---
kind: type
id: T:Autodesk.Revit.DB.ShellLayerType
source: html/75c640b9-9904-7882-43fc-a4dfc25ff53c.htm
---
# Autodesk.Revit.DB.ShellLayerType

Used to distinguish exterior and interior shell layers.

## Syntax (C#)
```csharp
public enum ShellLayerType
```

## Remarks
Used as an argument to methods of CompoundStructure that deal with shell layers.